def e04():
    output = None
    # ↓作答區域 注意要多於30個字才算分，若真的寫不出來可用 「...」 替代↓
    # output = '...' (輸入單行字串)
    # 另外也可以用三個單引號或雙引號，輸入多行字串
    # output = '''
    # ...第一行...
    # ...第二行...
    # ...
    # '''

    output = '''\
    1. 我常常會分享我自己的部落格文章，像是 Git 的基本操作，推薦沒有廣告的瀏覽器 -- Brave，我會充分的表達內容以及出處，讓大家可以更了解這些知識。
    2. 我覺得用 Emoji 的方式可以更鼓勵大家作出回應，因為點擊 Emoji 比較簡單，甚至可能只需要幾秒鐘的時間，不只可以確認大家有閱讀之外，也能更吸引大家做回覆！
    3. AI 回覆，我覺得大多時間是準確的，甚至能針對不同領域學生提出的話給予建議，我覺得這點非常棒！不過有時候的確沒有到非常準，但是我覺得這是可以接受的，畢竟 AI 還在學習當中，我相信未來會越來越好！
    '''

    # ↑作答區域↑
    return output