def e09():
    output = None
    # ↓作答區域 注意要多於30個字才算分，若真的寫不出來可用 「...」 替代↓
    # output = '...' (輸入單行字串)
    # 另外也可以用三個單引號或雙引號，輸入多行字串
    # output = '''
    # ...第一行...
    # ...第二行...
    # ...
    # '''

    output = '''\
    1. 我想給自己打 9 分，因為我常常在這堂課會覺得自己有先學過就大以輕心，
    但是其實還有很多內容很直得我去學習，例如 Python 語言本身的資料型別 mutable 跟 immutable，
    這樣的觀念，在未來開發的路上都是非常有幫助的！甚至是網路爬蟲，我們可以做一個自己的助手幫助我們
    的生活瑣事，這樣的內容都是非常有趣的，也是我想要學習的內容。

    2. 我想給老師打 10 分，上完這堂課我真的感受到老師的熱情以及用心，老師不只會教我們課本上的內容，
    我還看到老師在很多課後的時間投入開發，為了讓我們課堂中享受更多的樂趣，我覺得這是非常難得的，
    甚至是更新的學習方法，感受到真正的跨域學習，謝謝老師！
    '''

    # ↑作答區域↑
    return output